// 霸都丶傲天 2019年10月10日 https://github.com/AJLoveChina/birthday
var config = {
    // 句子的长度可以任意， 你可以写十句话， 二十句话都可以
    // 每句话尽量不要超过15个字,不然展示效果可能不太好
    texts: [
        "樊芃文小朋友~",
        "今天是你的生日了哟~",
        "首先，居居宝祝你生日快乐呀~",
        "其次就是，可怜怜的小朋友~"
        "今年的生日没有收到居居的礼物~",
        "但是，居居日后肯定给你补上~",
        "还有，虽然居居经常惹你生气气~",
        "但是居居其实还是心地善良的~",
        "居居以后努力不惹你生气气~",
        "居居好好努力~",
        "你也要在接下来的日子好好努力哟~",
        "争取在最短的时间内可以结束异地哟~",
        "居居没有太大的能力~",
        "（偷偷告诉你）",
        "这部分知识其实不会做",
        "是套用了一个现成的模板~",
        "不能嫌弃我~",
        "卖萌，嘟嘟嘴~",
        "亲亲~ლ(°◕‵ƹ′◕ლ)",
        "抱抱~(づ｡◕‿‿◕｡)づ",
        "举高高~",
        "a ao 一口吃掉~",
        "啦啦啦啦啦~生日快乐啦~",
        "这里就结束啦~",
        "木马~",
    ],
    /**
     * imgs 可以不填, 但是如果要填写的话必须遵循下面的格式
     * "对应上面的文字, 要完全一样" : "图片地址, 可以把图片放在imgs文件夹中"
     * 例如
     * "心爱的小可爱": "./imgs/xiaokeai.jpg"
     *
     * 如果不要图片的话, 直接在每行开头写两个斜杠注释即可, 例如下面的 "今天是你的生日" 的图片就不会展示了:)
     * Tip: 图片最好用正方形or接近正方形, 看起来效果更好
     */
    imgs: {
        "心爱的小可爱": "./imgs/xiaokeai.png",
        // "今天是你的生日": "./imgs/birthday.jpg",
    },
    // 按钮文字描述, 以下是默认的按钮文字，英文的，您可以改成你喜欢的文字
    desc: {
        turn_on: "开始",
        play: "音乐",
        bannar_coming: "颜色",
        balloons_flying: "好像少点东西",
        cake_fadein: "蛋糕？",
        light_candle: "蜡烛？",
        wish_message: "生日快乐",
        story: "A MESSAGE FOR YOU",
    }
};
